
package ru.otus;
import ru.otus.homework.common.MyClassToTest;
import ru.otus.homework.tester.MySimpleTestRunner;

import static org.assertj.core.api.Assertions.assertThat;

/*
        1. создать три аннотации - @Test, @Before, @After.
        2. Создать класс-тест, в котором будут методы, отмеченные аннотациями.
        3. Создать "запускалку теста". На вход она должна получать имя класса с тестами, в котором следует найти и запустить методы отмеченные аннотациями и пункта 1.
        4. Алгоритм запуска должен быть следующий::
            метод(ы) Before
            текущий метод Test
            метод(ы) After
            для каждой такой "тройки" надо создать СВОЙ объект класса-теста.
        5. исключение в одном тесте не должно прерывать весь процесс тестирования.
        6. На основании возникших во время тестирования исключений вывести статистику выполнения тестов (сколько прошло успешно, сколько упало, сколько было всего)
        7. "Запускалка теста" не должна иметь состояние, но при этом весь функционал должен быть разбит на приватные методы.
        Надо придумать, как передавать информацию между методами.
 */
public class Homework03Starter {
    public static void main(String... args) throws ReflectiveOperationException {
            new MySimpleTestRunner().run(MyClassToTest.class);
    }
}
